In [1]:
import pandas as pd
import matplotlib.pyplot as plt
# import wbgapi as wb
# from scipy.stats import linregress

## Extract Data
### Create reference data:

#### Countries allowed:
* Number of Gold Medals >0 & Rank by Total Medals <=20

#### Medal types:
* Gold & Total

In [39]:
from sqlalchemy import create_engine
import sqlalchemy

In [41]:
# Path to sqlite
database_path = '../Resources/Medals.xlsx'

In [42]:
engine = create_engine(f"excel:///?Excel File={database_path}")

NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:excel

In [ ]:
engine = create_engine("excel:///?Excel File='C:/MyExcelWorkbooks/SampleWorkbook.xlsx'")

In [4]:
# Load data about all athletes to dataframe
athl_path = "../Resources/Athletes.csv"
all_athl = pd.read_csv(athl_path)
all_athl

                        Name      NOC           Discipline
0            AALERUD Katrine   Norway         Cycling Road
1                ABAD Nestor    Spain  Artistic Gymnastics
2          ABAGNALE Giovanni    Italy               Rowing
3             ABALDE Alberto    Spain           Basketball
4              ABALDE Tamara    Spain           Basketball
...                      ...      ...                  ...
11080  ZWICKER Martin Detlef  Germany               Hockey
11081      ZWOLINSKA Klaudia   Poland         Canoe Slalom
11082           ZYKOVA Yulia      ROC             Shooting
11083      ZYUZINA Ekaterina      ROC              Sailing
11084        ZYZANSKA Sylwia   Poland              Archery

[11085 rows x 3 columns]

In [6]:
# Apply BR: Each cell should contain a single value

# Split Name column values into two separated columns
columnsplit = all_athl['Name'].str.split(" ", expand=True)
all_athl = all_athl.assign(Last_name=columnsplit[0],First_name=columnsplit[1])
all_athl.head()

                Name     NOC           Discipline Last_name First_name
0    AALERUD Katrine  Norway         Cycling Road   AALERUD    Katrine
1        ABAD Nestor   Spain  Artistic Gymnastics      ABAD     Nestor
2  ABAGNALE Giovanni   Italy               Rowing  ABAGNALE   Giovanni
3     ABALDE Alberto   Spain           Basketball    ABALDE    Alberto
4      ABALDE Tamara   Spain           Basketball    ABALDE     Tamara

In [7]:
# Drop Name column
all_athl = all_athl.drop(['Name'], axis=1)
all_athl.head()

      NOC           Discipline Last_name First_name
0  Norway         Cycling Road   AALERUD    Katrine
1   Spain  Artistic Gymnastics      ABAD     Nestor
2   Italy               Rowing  ABAGNALE   Giovanni
3   Spain           Basketball    ABALDE    Alberto
4   Spain           Basketball    ABALDE     Tamara

In [9]:
# Reorder columns
all_athl = all_athl[["Last_name","First_name", "NOC", "Discipline"]]
all_athl

       Last_name First_name      NOC           Discipline
0        AALERUD    Katrine   Norway         Cycling Road
1           ABAD     Nestor    Spain  Artistic Gymnastics
2       ABAGNALE   Giovanni    Italy               Rowing
3         ABALDE    Alberto    Spain           Basketball
4         ABALDE     Tamara    Spain           Basketball
...          ...        ...      ...                  ...
11080    ZWICKER     Martin  Germany               Hockey
11081  ZWOLINSKA    Klaudia   Poland         Canoe Slalom
11082     ZYKOVA      Yulia      ROC             Shooting
11083    ZYUZINA  Ekaterina      ROC              Sailing
11084   ZYZANSKA     Sylwia   Poland              Archery

[11085 rows x 4 columns]

In [10]:
# Apply BR: Values in cells should be Capitalized
all_athl['Last_name'] = all_athl['Last_name'].str.capitalize()
all_athl

       Last_name First_name      NOC           Discipline
0        Aalerud    Katrine   Norway         Cycling Road
1           Abad     Nestor    Spain  Artistic Gymnastics
2       Abagnale   Giovanni    Italy               Rowing
3         Abalde    Alberto    Spain           Basketball
4         Abalde     Tamara    Spain           Basketball
...          ...        ...      ...                  ...
11080    Zwicker     Martin  Germany               Hockey
11081  Zwolinska    Klaudia   Poland         Canoe Slalom
11082     Zykova      Yulia      ROC             Shooting
11083    Zyuzina  Ekaterina      ROC              Sailing
11084   Zyzanska     Sylwia   Poland              Archery

[11085 rows x 4 columns]

In [5]:
# Load data about all teams to dataframe
team_path = "../Resources/Teams.csv"
all_team = pd.read_csv(team_path)
all_team

              Name      Discipline                         NOC  Event
0          Belgium  3x3 Basketball                     Belgium    Men
1            China  3x3 Basketball  People's Republic of China    Men
2            China  3x3 Basketball  People's Republic of China  Women
3           France  3x3 Basketball                      France  Women
4            Italy  3x3 Basketball                       Italy  Women
..             ...             ...                         ...    ...
738   South Africa      Water Polo                South Africa  Women
739          Spain      Water Polo                       Spain    Men
740          Spain      Water Polo                       Spain  Women
741  United States      Water Polo    United States of America    Men
742  United States      Water Polo    United States of America  Women

[743 rows x 4 columns]

In [11]:

# Check on one discpiline first
disciplines = all_team['Discipline'].unique()
disciplines

array(['3x3 Basketball', 'Archery', 'Artistic Gymnastics',
       'Artistic Swimming', 'Athletics', 'Baseball/Softball',
       'Basketball', 'Beach Volleyball', 'Cycling Track', 'Fencing',
       'Football', 'Handball', 'Hockey', 'Rhythmic Gymnastics',
       'Rugby Sevens', 'Swimming', 'Table Tennis', 'Triathlon',
       'Volleyball', 'Water Polo'], dtype=object)

In [16]:
a1 = all_athl.loc[all_athl["Discipline"]=="Table Tennis"]
a1

        Last_name First_name                       NOC    Discipline
20      Abdelaziz      Farah                     Egypt  Table Tennis
75        Achanta      Kamal                     India  Table Tennis
112      Afanador      Brian               Puerto Rico  Table Tennis
208       Alamian       Nima  Islamic Republic of Iran  Table Tennis
270    Alkhadrawi        Ali              Saudi Arabia  Table Tennis
...           ...        ...                       ...           ...
10900        Yuan        Jia                    France  Table Tennis
10959        Zaza       Hend      Syrian Arab Republic  Table Tennis
11004       Zhang       Lily  United States of America  Table Tennis
11010       Zhang         Mo                    Canada  Table Tennis
11040        Zhou        Xin  United States of America  Table Tennis

[164 rows x 4 columns]

In [17]:
t1 = all_team.loc[all_team["Discipline"]=="Table Tennis"]
t1

,Name,Discipline,NOC,Event
631,Australia,Table Tennis,Australia,Men's Team
632,HU Heming / TAPPER Melissa,Table Tennis,Australia,Mixed Doubles
633,Australia,Table Tennis,Australia,Women's Team
634,FEGERL Stefan / POLCANOVA Sofia,Table Tennis,Austria,Mixed Doubles
635,Austria,Table Tennis,Austria,Women's Team
636,Brazil,Table Tennis,Brazil,Men's Team
637,Brazil,Table Tennis,Brazil,Women's Team
638,WANG Zhen / ZHANG Mo,Table Tennis,Canada,Mixed Doubles
639,China,Table Tennis,People's Republic of China,Men's Team
640,XU Xin / LIU Shiwen,Table Tennis,People's Republic of China,Mixed Doubles
641,China,Table Tennis,People's Republic of China,Women's Team
642,Chinese Taipei,Table Tennis,Chinese Taipei,Men's Team
643,LIN Yun Ju / CHENG I Ching,Table Tennis,Chinese Taipei,Mixed Doubles
644,Chinese Taipei,Table Tennis,Chinese Taipei,Women's Team
645,Croatia,Table Tennis,Croatia,Men's Team
646,CAMPOS Jorge / FONSECA Daniela,Table Tennis,Cuba,Mixed Doubles
647,Egypt,Table Tennis,Egypt,Men's Team
648,ASSAR Omar / MESHREF Dina,Table Tennis,Egypt,Mixed Doubles
649,Egypt,Table Tennis,Egypt,Women's Team
650,France,Table Tennis,France,Men's Team
651,LEBESSON Emmanuel / YUAN Jia Nan,Table Tennis,France,Mixed Doubles
652,France,Table Tennis,France,Women's Team
653,Germany,Table Tennis,Germany,Men's Team
654,FRANZISKA Patrick / SOLJA Petrissa,Table Tennis,Germany,Mixed Doubles
655,Germany,Table Tennis,Germany,Women's Team
656,"Hong Kong, China",Table Tennis,"Hong Kong, China",Men's Team
657,WONG Chun Ting / DOO Hoi Kem,Table Tennis,"Hong Kong, China",Mixed Doubles
658,"Hong Kong, China",Table Tennis,"Hong Kong, China",Women's Team
659,SZUDI Adam / PERGEL Szandra,Table Tennis,Hungary,Mixed Doubles
660,Hungary,Table Tennis,Hungary,Women's Team
661,ACHANTA Kamal / BATRA Manika,Table Tennis,India,Mixed Doubles
662,Japan,Table Tennis,Japan,Men's Team
663,MIZUTANI Jun / ITO Mima,Table Tennis,Japan,Mixed Doubles
664,Japan,Table Tennis,Japan,Women's Team
665,Poland,Table Tennis,Poland,Women's Team
666,Portugal,Table Tennis,Portugal,Men's Team
667,Republic of Korea,Table Tennis,Republic of Korea,Men's Team
668,LEE Sangsu / JEON Jihee,Table Tennis,Republic of Korea,Mixed Doubles
669,Republic of Korea,Table Tennis,Republic of Korea,Women's Team
670,IONESCU Ovidiu / SZOCS Bernadette,Table Tennis,Romania,Mixed Doubles
671,Romania,Table Tennis,Romania,Women's Team
672,Serbia,Table Tennis,Serbia,Men's Team
673,Singapore,Table Tennis,Singapore,Women's Team
674,PISTEJ Lubomir / BALAZOVA Barbora,Table Tennis,Slovakia,Mixed Doubles
675,Slovenia,Table Tennis,Slovenia,Men's Team
676,Sweden,Table Tennis,Sweden,Men's Team
677,United States,Table Tennis,United States of America,Men's Team
678,United States,Table Tennis,United States of America,Women's Team

In [18]:
# Join athletes and teams to know which athletes teams
athl_team = pd.merge(a1, t1, on=["NOC","Discipline"])
athl_team

,Last_name,First_name,NOC,Discipline,Name,Event
0,Abdelaziz,Farah,Egypt,Table Tennis,Egypt,Men's Team
1,Abdelaziz,Farah,Egypt,Table Tennis,ASSAR Omar / MESHREF Dina,Mixed Doubles
2,Abdelaziz,Farah,Egypt,Table Tennis,Egypt,Women's Team
3,Assar,Omar,Egypt,Table Tennis,Egypt,Men's Team
4,Assar,Omar,Egypt,Table Tennis,ASSAR Omar / MESHREF Dina,Mixed Doubles
...,...,...,...,...,...,...
243,Pergel,Szandra,Hungary,Table Tennis,Hungary,Women's Team
244,Pota,Georgina,Hungary,Table Tennis,SZUDI Adam / PERGEL Szandra,Mixed Doubles
245,Pota,Georgina,Hungary,Table Tennis,Hungary,Women's Team
246,Szudi,Adam,Hungary,Table Tennis,SZUDI Adam / PERGEL Szandra,Mixed Doubles
247,Szudi,Adam,Hungary,Table Tennis,Hungary,Women's Team

In [28]:
# transform medals
# Apply BR: - extract only countries with gold medal >0 
# - extract only countries that have rank by total <=20
# 2. Medals/ranks type: 
# - Gold
# - Total
medals_path = "../Resources/Medals.csv"
all_med = pd.read_csv(medals_path)
all_med

,Rank,NOC,Gold,Silver,Bronze,Total,Rank by Total
0,1,United States of America,39,41,33,113,1
1,2,People's Republic of China,38,32,18,88,2
2,3,Japan,27,14,17,58,5
3,4,Great Britain,22,21,22,65,4
4,5,ROC,20,28,23,71,3
...,...,...,...,...,...,...,...
88,86,Ghana,0,0,1,1,77
89,86,Grenada,0,0,1,1,77
90,86,Kuwait,0,0,1,1,77
91,86,Republic of Moldova,0,0,1,1,77
92,86,Syrian Arab Republic,0,0,1,1,77

In [29]:
# Remove silver, bronze
# all_med[["NOC", "Rank", "Rank by Total", "Gold", "Total", ]]
all_med = all_med.drop(["Silver", "Bronze"], axis=1)
all_med

    Rank                         NOC  Gold  Total  Rank by Total
0      1    United States of America    39    113              1
1      2  People's Republic of China    38     88              2
2      3                       Japan    27     58              5
3      4               Great Britain    22     65              4
4      5                         ROC    20     71              3
..   ...                         ...   ...    ...            ...
88    86                       Ghana     0      1             77
89    86                     Grenada     0      1             77
90    86                      Kuwait     0      1             77
91    86         Republic of Moldova     0      1             77
92    86        Syrian Arab Republic     0      1             77

[93 rows x 5 columns]

In [31]:
# Apply BR: - extract only countries with gold medal >0 
# - extract only countries that have rank by total <=20
medals = all_med.loc[(all_med["Gold"]>0)&(all_med["Rank by Total"]<=20)]
medals

    Rank                         NOC  Gold  Total  Rank by Total
0      1    United States of America    39    113              1
1      2  People's Republic of China    38     88              2
2      3                       Japan    27     58              5
3      4               Great Britain    22     65              4
4      5                         ROC    20     71              3
5      6                   Australia    17     46              6
6      7                 Netherlands    10     36              9
7      8                      France    10     33             10
8      9                     Germany    10     37              8
9     10                       Italy    10     40              7
10    11                      Canada     7     24             11
11    12                      Brazil     7     21             12
12    13                 New Zealand     7     20             13
13    14                        Cuba     7     15             18
14    15                     Hungary     6     20             13
15    16           Republic of Korea     6     20             13
16    17                      Poland     4     14             19
21    22                       Spain     3     17             17
23    24                 Switzerland     3     13             20
34    35                      Turkey     2     13             20
43    44                     Ukraine     1     19             16

In [34]:
noc = medals["NOC"].values
noc

array(['United States of America', "People's Republic of China", 'Japan',
       'Great Britain', 'ROC', 'Australia', 'Netherlands', 'France',
       'Germany', 'Italy', 'Canada', 'Brazil', 'New Zealand', 'Cuba',
       'Hungary', 'Republic of Korea', 'Poland', 'Spain', 'Switzerland',
       'Turkey', 'Ukraine'], dtype=object)